test/data/lists.org
* Unordered Lists

I want to make sure I have great support for lists.

- This is an unordered list
- This continues the unordered list

And this is a paragraph *after* the list.

** Wrapping within the list

   - This is a single-line list item in the org file.
   - Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam
     nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam
     erat, sed diam voluptua. At vero eos et accusam et justo duo
     dolores et ea rebum. Stet clita kasd gubergren, no sea takimata
     sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit
     amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor
     invidunt ut labore et dolore magna aliquyam erat, sed diam
     voluptua. At vero eos et accusam et justo duo dolores et ea
     rebum. Stet clita kasd gubergren, no sea takimata sanctus est
     Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet,
     consetetur sadipscing elitr, sed diam nonumy eirmod tempor
     invidunt ut labore et dolore magna aliquyam erat, sed diam
     voluptua. At vero eos et accusam et justo duo dolores et ea
     rebum. Stet clita kasd gubergren, no sea takimata sanctus est
     Lorem ipsum dolor sit amet.
   - And this is the next item. The previous item needs to be on one
     line to keep =textile= happy.
   - Ditto the previous line, actually.

** Edge cases

   - This is a single-line list.
   And this is a *separate paragraph.* Note the indentation in the org
   file.

** Indent and Indent and Indent ...

- first list: first item
    first list item
    same indent
      deeper
- first list: second item
  + second list : first item
  + second list : second item
    * third list : first item
  + second list : third item
- first list: third item

* Ordered list

1. first list: first item
  1) second list: first item
     - unordered list
     - unordered list
  1) second list: second item
     
     this has brank line
1. I can't count mmm.

** Indent Indent Indent ...

   1. white line ↓

      same indent line
   2. next item?
      
      ↑ space indented line

    this line is in.
   this line out of list.

* Description list
  
- Elijah Wood :: He plays Frodo
- Sean Austin :: He plays Sam, Frodo's friend.  I still remember
  him very well from his role as Mikey Walsh in The Goonies.
- the P :: this is test.

 next paragraph? <- No.
next paragraph.
