test/data/lists.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="ja" xml:lang="ja">
<head>
<title>lists</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-03-08 17:32:18 JST"/>
<meta name="author" content="Kensei Nakamura"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">lists</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Unordered Lists </h2>
<div class="outline-text-2" id="text-1">

<p>I want to make sure I have great support for lists.
</p>
<ul>
<li>
This is an unordered list
</li>
<li>
This continues the unordered list

</li>
</ul>

<p>And this is a paragraph <b>after</b> the list.
</p>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Wrapping within the list </h3>
<div class="outline-text-3" id="text-1.1">

<ul>
<li>
This is a single-line list item in the org file.
</li>
<li>
Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam
nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam
erat, sed diam voluptua. At vero eos et accusam et justo duo
dolores et ea rebum. Stet clita kasd gubergren, no sea takimata
sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit
amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor
invidunt ut labore et dolore magna aliquyam erat, sed diam
voluptua. At vero eos et accusam et justo duo dolores et ea
rebum. Stet clita kasd gubergren, no sea takimata sanctus est
Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet,
consetetur sadipscing elitr, sed diam nonumy eirmod tempor
invidunt ut labore et dolore magna aliquyam erat, sed diam
voluptua. At vero eos et accusam et justo duo dolores et ea
rebum. Stet clita kasd gubergren, no sea takimata sanctus est
Lorem ipsum dolor sit amet.
</li>
<li>
And this is the next item. The previous item needs to be on one
line to keep <code>textile</code> happy.
</li>
<li>
Ditto the previous line, actually.

</li>
</ul>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Edge cases </h3>
<div class="outline-text-3" id="text-1.2">

<ul>
<li>
This is a single-line list.
</li>
</ul>

<p>And this is a <b>separate paragraph.</b> Note the indentation in the org
file.
</p>
</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> Indent and Indent and Indent &hellip; </h3>
<div class="outline-text-3" id="text-1.3">

<ul>
<li>
first list: first item
first list item
same indent
deeper
</li>
<li>
first list: second item
<ul>
<li>
second list : first item
</li>
<li>
second list : second item
<ul>
<li>
third list : first item
</li>
</ul>
</li>
<li>
second list : third item
</li>
</ul>
</li>
<li>
first list: third item

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Ordered list </h2>
<div class="outline-text-2" id="text-2">

<ol>
<li>
first list: first item
<ol>
<li>
second list: first item
<ul>
<li>
unordered list
</li>
<li>
unordered list
</li>
</ul>
</li>
<li>
second list: second item

<p>
this has brank line
</p></li>
</ol>
</li>
<li>
I can't count mmm.

</li>
</ol>

</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> Indent Indent Indent &hellip; </h3>
<div class="outline-text-3" id="text-2.1">

<ol>
<li>
white line ↓

<p>
same indent line
</p></li>
<li>
next item?

<p>
↑ space indented line
</p>
<p>
this line is in.
</p></li>
</ol>

<p>this line out of list.
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Description list </h2>
<div class="outline-text-2" id="text-3">

<dl>
<dt>Elijah Wood</dt><dd>
He plays Frodo
</dd>
<dt>Sean Austin</dt><dd>
He plays Sam, Frodo's friend.  I still remember
him very well from his role as Mikey Walsh in The Goonies.
</dd>
<dt>the P</dt><dd>
this is test.

<p>
next paragraph? &lt;- No.
</p></dd>
</dl>

<p>next paragraph.
</p>
</div>
</div>
<div id="postamble">
</div>
</div>
</body>
</html>
